/*упражнение 1.5 - вывод таблицы в обратном порядке*/

#include <stdio.h> //подключаем заголовочный файл, включаем информацию о стандартной библиотеке вводда-вывода
int main () { /*определение функции main; тип возвращаемого значения - целое число.
				операторы main заключаем в фигурные скобки*/
	
	int fahr; /*объявление переменной с типом int*/
	
	printf("fahr celsius\n"); /*вызов функции printf - форматированного вывода. аргумент -форматная строка с текстом - заголовком таблицы. 
														\n - escape-последовательность внутри строкового литерала, 
															переводит курсор на новую строку*/
	
	for (fahr = 300; fahr >= 0; fahr = fahr - 20) /*цикл for, состоящий из блоков:
													1 - инициализация переменной-счетчика, 
													2 - условие, управляющее выполнением цикла (выполнять тело цикла, 
														пока условие истинно - то есть:
														пока  fahr больше или равно нулю)
													3 - модификация переменной, управляющей циклом: 
													после каждой завершенной итерации переменная fahr уменьшается на 20
		
													тело цикла — один оператор, поэтому фигурные скобки не нужны*/
		
		printf("%3d %6.1f\n", fahr, (5.0 / 9.0) * (fahr - 32)); /*вызываем функцию printf - форматированного вывода
	                                                               в которой первый аргумент - строка формата с двумя спецификаторами:
																   %3d означает, что на это место будет выведено целочисленное 
	                                                               значение переменной (fahr) в поле, шириной не менее 3 символов; 
	                                                               %6.1f означает, что будет выведено значение выражения - (третьего аргумента) 
																	(5.0 / 9.0) * (fahr - 32) в виде дробного числа в поле шириной не менее 6 символов
																	и одной цифрой после плавающей точки.
																	
	                                                                аргументом может быть выражение.
	                                                                поскольку третьим аргументом должно быть вещественнозначное число, 
																	выводимое по спецификации %6.1f на этом месте может стоять любое вещественнозначное
																    выражение*/
	return 0; /*сообщаем ОС об успешном завершении программы, код возврата - 0*/
}
