//Упражнение 1.1

//1
/*убрала двойные кавычки в аргументе функции*/
#include <stdio.h>
int main () {
	printf (Hello, world\n); /*ошибка ([Ошибка]  'Hello' was not declared in this scope;) переводится как
							<<'Hello' не было объявлено в этой области видимости>>.
							возникает, 
							когда компилятор встречает в коде имя, которое не было объявлено
							
							из-за того, что убраны двойные кавычки,
							компилятор видит слова Hello и world не как строковый литерал (текст для вывода), 
							а как имена переменных, которые не были объявлены*/
	return 0;
}

//2
/*убрала точку с запятой после закрывающей скобки в printf*/

#include <stdio.h>
int main () {
	printf ("Hello, world\n") 	/* ошибка (expected ';' before 'return') возникает, 
								когда компилятор ждёт точку с запятой перед return, что*/
	return 0;
}

//3
/*убрала закрывающую скобку в printf*/

#include <stdio.h>
int main () {
	printf ("Hello, world\n"; 		/*ошибка (expected ')' before ';' token)
									означает, что компилятор ждёт закрывающую скобку ) 
									перед точкой с запятой ; в определённом месте кода. */
			return 0;
			}


//4
/*убрала букву f из имени функции*/

#include <stdio.h>
int main () {
	print ("Hello, world\n");		 /* Ошибка ('print' was not declared in this scope; did you mean 'printf'?) 
									возникает когда компилятор не находит функцию с именем print, но при этом в коде есть её вызов. он предполагает что
									мы имели ввиду стандартную библиотечную функцию, предлагая исправление*/
	return 0;
}

//5
/*убрала круглые скобки после int main */
#include <stdio.h>
int main {  								/*<<[Ошибка] cannot declare '::main' to be a global variable>> означает,
											что невозможно объявить '::main' как глобальную переменную.
											Возникает, когда компилятор видит int main { ... } без скобок. 
											Он думает, что ты пытаешься создать переменную с именем main,
											а не функцию (точку входа).
											
											[Замечание] <<to match this	'{'>> означает, что компилятор нашел фигурную скобку, 
											но не нашел пары для нее*/
	printf ("Hello, world\n"); 
	return 0;								/*<<[Ошибка] expected unqualified-id before 'return'>> переводится как 
											<<ожидался неквалифицированный идентификатор перед 'return'>>, возникает
											из-за того, что main не был распознан как функцият поэтому компилятор считает,
											что return находится в глобальной области видимости (вне функций).
											*/
	
}											/*<<[Ошибка] expected declaration before '}' token>> переводится как
											<<Ожидалось объявление перед символом '}'>>*/

//6
/*убрала фигурные скобки в main*/

#include <stdio.h>
int main () 
printf ("Hello, world\n");			 /*[Ошибка] <<expected initializer before 'printf'>>
									переводится как ожидался инициализатор перед 'printf'
									Возникает, когда компилятор видит вызов функции (printf(...)) там,
									где ожидает объявление переменной (то есть вне тела какой-либо функции).
									Так как фигурные скобки {} удалены, компилятор считает, 
									что строка int main () — это просто объявление глобальной переменной 
									с именем main, а printf — это попытка присвоить ей значение без знака = */

return 0;                           /*[Ошибка] <<expected unqualified-id before 'return'>> 
									переводится как ожидался неквалифицированный идентификатор перед 'return'
									Из-за отсутствия фигурных скобок оператор return 
									оказался в глобальной области видимости. 
									Ключевое слово return (возврат из функции) имеет смысл только внутри функции.
									Компилятор видит его вне функции и не понимает, что с ним делать.
									
									*/

