#include <stdio.h> /*подключаем заголовочный файл stdio.h, включаем информацию о стандартной библиотеке ввода-вывода*/

int main () { /*определение функции main тип возвращаемого значения: целое число*/
           /*операторы main заключаем в фигурные скобки*/
	
	float fahr, celsius; /*объявляем переменные с типом float - число с плавающей точкой*/
	int lower, upper, step; /* Объявляем переменные с типом int - целые числа*/
	
	lower = 0; /*присваиваем lower начальное значение. 	нижняя граница температур в таблице*/
	upper = 300; /*присваиваем upper начальное значение. верхняя граница*/
	step = 20; /*присваиваем step начальное значение. величина шага*/
	
	celsius = lower; /*присваиваем начальное значение счетчику цикла: первая температура таблицы*/
	
	printf("Celsius  fahr\n"); /*вызываем printf - функцию форматированного вывода. 
	выводим заголовок таблицы(строковый литерал) \n - перевод строки*/
	
	while(celsius <= upper){ /*цикл: пока celsius не привысит верхнюю границу, выполняем тело цикла*/
		
		fahr =  celsius * 9.0 / 5.0  + 32.0; /*формула перевода из Цельсия в  Фаренгейты. пишем 5.0 и 9.0 чтобы
		деление было вещественным и весь результат не обнулился бы*/
		
		printf("%6.1f   %3.1f\n", celsius, fahr); /*вызываем функцию printf. 
			Спецификатор %6.1f - выводим число (celsius), в поле не менее 6 символов,
		с одной цифрой после десятичной точки. спецификатор %3.1f указывает на то,
		что мы выводим вещественное число (fahr) в поле шириной не менее 3 символов
		без десятичной точки и дробной части.
	*/
		celsius = celsius + step;
	}
		return 0;
}
