#include <stdio.h>
int main () {
	printf("Hello, \nWorld");
	return 0;
}
// \1, \2, \3, \4,\5, \6, \7 - ничего не вывелось, ничего не поменялось. это непечатаемые управляющие символы

/*\8, \9, - [Предупреждение]  unknown escape sequence: '\9' - неизвестная эскейп-последовательность; 
программа запустилась, вывелось Hello, world9*/

/*[Предупреждение]  embedded '\0' in format [-Wformat-contains-nul]   
Я вставила \0 внутрь текста: "Hello, \0world!". В языке C символ \0 означает конец строки. 
Функция printf при чтении строки остановится на этом символе и не выведет то, 
что написано после него. Компилятор предупреждает, что остаток текста может быть отброшен.
Вывелось: Hello,*/

// \a - ничего не произошло

// \q, \w, \e, \y, \m, \i, \o, \s, \d, \g, \h, \j, \k, \l, \;, \:, \c, \m, \,, \., \/, \@, \#, \$, \%, \^, \&, \*, \(, \), \-, \=, \+  - unknown escape sequence - текст выводится вместе с символом

/* \u [Ошибка]  incomplete universal character name \u -  ошибка возникает,
когда компилятор видит последовательность \u (которая в C означает
«сейчас будет четырёхзначный код символа Unicode»),
но после неё не хватает нужного количества цифр
или там стоят неправильные символы. Компилятор ждёт ровно 4 шестнадцатеричные цифры

я ввела \u0431 вывелась латинская буква p*/

// \r (Возврат каретки) не стирает, а перемещает курсор в начало текущей строки

// \t табуляция

// \f, \v - слово world перенеслось вниз на новую строчку ровно в ту же позицию, в которой оно располагалось изначально

// \' - вывод одинарной кавычки

// \" - вывод двойной кавычки

// \? - вывод знака вопроса

// \x [Ошибка]  \x used with no following hex digits - <<Использован \x без следующих за ним шестнадцатеричных цифр.>>

// \b шаг назад с затиранием назад

// \n перенос на начало следующей строки

// \\ - вывод косой черты

/*вывод: управляющие последовательности делятся на

Печатаемые: \', \", \\, \?

Управляющие символы: \n, \t, \r, \b, \a, \f, \v

Числовые коды: \0, \123 (восьмеричные), \x41 (hex), \u0431 (Unicode)

Неизвестные: всё остальное.

*/
