/*Упражнение 1.3*/

#include <stdio.h> /*подключаем заголовочный файл stdio.h, включаем информацию о стандартной библиотеке ввода-вывода*/
int main() /*определение функции main тип возвращаемого значения: целое число*/
{            /*операторы main заключаем в фигурные скобки*/
	
	float fahr, celsius; /*объявляем переменные с типом float - число с плавающей точкой*/
	int lower, upper, step; /* Объявляем переменные с типом int - целые числа*/
	
	lower = 0; /*присваиваем lower начальное значение. 	нижняя граница температур в таблице*/
	upper = 300; /*присваиваем upper начальное значение. верхняя граница*/
	step = 20; /*присваиваем step начальное значение. величина шага*/
	
	
	fahr = lower; /*задаем(присваиваем) начальное значение счетчику цикла: первая температура таблицы*/
	
	printf("Fahr Celsius\n"); /*вызываем printf - функцию форматированного вывода. 
	выводим заголовок таблицы(строковый литерал) \n - перевод строки*/
	
	while (fahr <= upper) { /*цикл: пока fahr не привысит верхнюю границу, выполняем тело цикла*/
		
		celsius = (5.0 / 9.0) * (fahr - 32.0); /*формула перевода из Фаренгейт в Цельсия. пишем 5.0 и 9.0 чтобы
		деление было вещественным и весь результат не обнулился бы*/
		
		printf("%3.0f %6.1f\n", fahr, celsius); /*вызываем функцию printf. спецификатор %3.0f указывает на то,
													что мы выводим вещественное число (fahr) в поле шириной не менее 3 символов
													без десятичной точки и дробной части.
													Спецификатор %6.1f - выводим число (celsius), в поле не менее 6 символов,
													с одной цифрой после десятичной точки*/
		fahr = fahr + step; /*увеличиваем счетчик на шаг - и переходим к следующей температуре таблицы*/
	}
	return 0; /*сообщаем ОС что программа завершилась успешно (код возврата 0) (любое ненулевое значение означает «неуспех»)*/
}
